Revit 2027 API
Transform1D.Scale Property
 The real number that represents the scale of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Scale { get; set; }
Public Property Scale As Double
	Get
	Set
public:
property double Scale {
	double get ();
	void set (double value);
}
member Scale : float with get, set
Property Value
Double
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace